Repository: hmmh/typo3-ext-turnjs
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# sheet.main
source: Main
de: Allgemein

# flexform.startingPoint
source: Starting point (default is current page)
de: Startpunkt (Standardwert ist die aktuelle Seite)

# flexform.excludeStartingPoint
source: Exclude starting point
de: Startpunkt selbst ausschließen

# flexform.treelevel
source: Treelevel (recursion depth)
de: Baumlevel (Rekursionstiefe)

# flexform.selectPages
source: Select pages
de: Seiten auswählen

# flexform.mode
source: Select mode
de: Modus auswählen

# flexform.mode.0
source: Turn subpages
de: Unterseiten

# flexform.mode.1
source: Turn selected pages
de: Ausgewählte Seiten

# sheet.options
source: Options
de: Optionen

# flexform.true
source: true
de: an

# flexform.false
source: false
de: aus

# flexform.double
source: double
de: Doppelt

# flexform.single
source: single
de: Einfach

# flexform.ltr
source: left-to-right
de: links-nach-rechts

# flexform.rtl
source: right-to-left
de: rechts-nach-links

# flexform.options.display
source: Display
de: Anzeige

# flexform.options.autoCenter
source: AutoCenter
de: Autom. Zentrierung

# flexform.options.turnCorners
source: TurnCorners (possible values: "bl,br" or "tl,tr" or "bl,tr")
de: Ecken (mögliche Werte: "bl,br" oder "tl,tr" oder "bl,tr")

# flexform.options.width
source: Width (number)
de: Breite (Ziffer)

# flexform.options.height
source: Height (number)
de: Höhe (Ziffer)

# flexform.options.duration
source: Duration (number)
de: Dauer (Ziffer)

# flexform.options.direction
source: Direction
de: Richtung

# flexform.options.elevation
source: Elevation (number)
de: Aufriss (Ziffer)

# flexform.options.gradients
source: Gradients
de: Verläufe

# flexform.options.acceleration
source: Acceleration
de: Hardware-Acceleration

# constants.settings
source: Settings
de: Einstellungen

# constants.paths
source: Paths
de: Pfade

# constants.options
source: Options
de: Optionen

# constants.paths.templates
source: Path to template root (FE)
de: Pfad zum Template-Verzeichnis (FE)

# constants.paths.partials
source: Path to template partials (FE)
de: Pfad zum Partial-Verzeichnis (FE)

# constants.paths.layouts
source: Path to template layouts (FE)
de: Pfad zum Layout-Verzeichnis (FE)

# constants.settings.pagetype
source: pageType (for ajax loading)
de: Seitentyp (für AJAX)

# constants.settings.incjquery
source: Include jQuery
de: jQuery einbinden

# constants.settings.incturnjs
source: Include turn.js
de: Turn.js einbinden

# constants.settings.inchashjs
source: Include hash.js for hash URLs:Format #/page/<number>
de: Hash.js einbinden für Hash-URLs:Format #/page/<nummer>

# constants.settings.inccss
source: Include CSS
de: CSS styles einbinden

# constants.options.display
source: Display (Default value=double): Sets the display mode.Use single to show only one page per view or double to show two pages instead.
de: Anzeige (Standardwert=double):Anzeigemodus festlegen. Der Wert "single" zeigt nur eine Seite an, "double" zeigt zwei Seiten an.

# constants.options.width
source: Width: Sets the width of the page.
de: Breite: Legt die Breite der Seite fest.

# constants.options.height
source: Height: Sets the height of the flipbook.
de: Höhe: Legt die Höhe des Flipbooks fest.

# constants.options.duration
source: Duration (Default value=600): Sets the duration of the transition in milliseconds. If you set 0 (zero), there won't be transition while turning the page.
de: Dauer (Standardwert=600): Legt die Länge der Übergänge in Millisekunden fest. Wird 0 (null) gesetzt, gibt es keine Übergänge, wenn die Seiten gewechselt werden.

# constants.options.elevation
source: Elevation (Default value=0): Sets the elevation of the page during the transition.
de: Aufriss (Standardwert=0): Legt den Aufriss der Seite während des Übergangs fest (elevation).

# constants.options.autocenter
source: AutoCenter (Default value=false): Centers the flipbook depending on how many pages are visible. The autoCenter option changes the CSS margin-left property of the flipbook.
de: Autom. Zentrierung (Standard=false): Zentriert das Flipbook auf Basis der sichtbaren Seiten. Diese Option verändert die margin-left CSS-Eigenschaft des Flipbooks.

# constants.options.gradients
source: Gradients (Default value=true): Shows gradients and shadows during the transition.
de: Verläufe (Standardwert=true): Zeigt Verläufe und Schatten während des Übergangs an.

# constants.options.acceleration
source: Acceleration (Default value=true): Sets the hardware acceleration mode, for touch devices this value must be true.
de: Hardware-Beschl. (Standardwert=true): Legt den Hardware-Beschleunigungsmodus fest, für Touch-Geräte sollte dieser Wert true sein.

# constants.options.turncorners
source: TurnCorners (Default value=bl,br): Sets the corners to be used when turning the page from methods like page, next or previous.
de: Ecken (Standardwert=bl,br): Legt die Ecken fest, welche für das Drehen verwendet werden sollen (bl, br, tl, tr)

# constants.options.direction
source: Direction (Default value=ltr): Specifies the directionality of the flipbook left-to-right (DIR=ltr, the default) or right-to-left (DIR=rtl).
de: Richtung (Standardwert=ltr): Legt die Schreibrichtung des Flipbooks fest. Entweder links-nach-rechts (ltr, Standard) oder rechts-nach-links (rtl)
